cases/oneD_freely_propagating_flame/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/sampleConfigDict"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($UInlet 0 0);

boundaryField
{
    boundary
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform ($UInlet 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
