cases/oneD_freely_propagating_flame/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source OpenFOAM functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)
numProcessors=$(getNumberOfProcessors)

blockMesh > log.blockMesh 2>&1
checkMesh > log.checkMesh 2>&1
setFields > log.setFields 2>&1
decomposePar -force > log.decomposePar 2>&1
/usr/bin/mpirun -np $numProcessors --allow-run-as-root $application -parallel > log.mpirun 2>&1
reconstructPar > log.reconstructPar 2>&1